# 이렇게 풀어도 되나 싶다...
# 백준 골드 문제...ㅋㅋㅋㅋ

lst = [[37, 36, 35, 34, 33, 32, 31], 
       [38, 17, 16, 15, 14, 13, 30], 
       [39, 18, 5, 4, 3, 12, 29], 
       [40, 19, 6, 1, 2, 11, 28],
       [41, 20, 7, 8, 9, 10, 27],
       [42, 21, 22, 23, 24, 25, 26],
       [43, 44, 45, 46, 47, 48, 49]]

a, b, c, d = map(int, input().split()) 

for i in range(a + 3, c + 4):
    for j in range(b + 3, d + 4):
        if lst[i][j] < 10:
            print('%2d' %lst[i][j], end=' ')
        else:
            print(lst[i][j], end=' ')
    print()